#+PROPERTY: header-args:jupyter-python :session ~/jupyter-run/active-topo-2-ssh.json
#+PROPERTY: header-args:jupyter :session ~/jupyter-run/active-topo-2-ssh.json

#+begin_src jupyter
print("Welcome to EMACS Jupyter")
#+end_src

#+RESULTS:
: Welcome to EMACS Jupyter

#+STARTUP: :OVERVIEW

#+title: Topological analysis of SSCx (~flatmap~) Columns
We develop topological analyses for (hexagonal) columns orthogonal to the circuit's flatmap between layers 4 and 5. Each voxel in the circuit's volume is mapped to a pixel in the circuit's ~flatmap~. We use a hexagonal grid in the ~flatmap~ to define ~subtargets~ that are expanded into 3D by mapping each ~subtarget~ pixel back to its original voxel. We have used circuit ~flatmap~ to parameterize white-matter connectivity, and thalamic innervation. Here we use the hexagonal ~subtargets~ to scan spatial distribution of topological quantities such as ~simplex-counts~. While the scientific discussion will be developed elsewhere, here we will focus on developing a configuration of our analyses that we can use with ~connsense~ to run a pipeline that scans topological measurements over the circuits' ~flatmap~.


We start by discussing individual steps of the pipeline. The pipeline config will developed in the subsections [[Path]] and [[Parameters]] of [[Pipeline]] where we put together each step's config.

** ~connsense~ Modules
#+name: notebook-connsense-tap
#+begin_src jupyter-python
topotap_22 = cnstap.HDFStore(CONNSPACE/"pipeline.yaml", "connsense-2022-12.h5")
topotap = cnstap.HDFStore(CONNSPACE / "pipeline.yaml")
circuit = topotap.get_circuit("Bio_M")
pprint(topotap.analyses)
#+end_src

#+RESULTS: notebook-connsense-tap
:  2023-02-13 13:03:36,259: Load circuit Bio_M
: {'connectivity': {'model-params-dd2': <connsense.develop.topotap.TapDataset object at 0x7ffd4993a520>,
:                   'simplex-counts': <connsense.develop.topotap.TapDataset object at 0x7ffdda624d60>}}

** Notebook template
Finally, here is a template that we can use to start test-developing. We will deposit the code in a sub-directory, of the directory holding this file.
#+begin_src jupyter-python :tangle develop_topotap.py :comments no :noweb yes :padline yes
<<notebook-init>>

<<notebook-workspaces>>

<<notebook-connsense-tap>>

<<notebook-reloads>>
#+end_src

#+RESULTS:
: We will plot golden aspect ratios:  1.618033988749895
:  2023-02-14 16:11:49,403: Load circuit Bio_M
: {'connectivity': {'simplex-counts': <connsense.develop.topotap.TapDataset object at 0x7fff5c260610>}}

